package settlement

import "fmt"

type (
	OrderStatus       int
	OrderStatusDetail int
)

var (
	orderStatus = map[OrderStatus]string{
		-1: "删除",               // 被标记为删除的订单
		0:  "已受理理",             // ⽀支付订单接收成功，尚未处理理
		1:  "已打款",              // 订单提交到⽀支付⽹网关成功
		2:  "打款失败",             // 主要表示订单数据校验不不通过
		4:  "待打款(暂停处理理)",       // 暂停处理理，⼀一般是账户余额不不⾜足，充值后可以继续打款
		5:  "打款中(状态未知)",        // 调⽤用⽀支付⽹网关超时等状态异常情况导致，处于等待交易易查证的中间状态
		8:  "待打款",              // 订单税务筹划完毕，等待执⾏行行打款的状态
		9:  "打款失败(已退款，退汇或者冲正)", // 支付被退回
		11: "部分成功",             // 系统打款或经纪公司打款部分成功
		15: "取消支付",             // 订单被取消，⽆无需⽀支付
		18: "⽆需付款",             // 订单⽀支付⾦金金额为0的情况会出现此状态
	}
	orderStatusDetail = map[OrderStatusDetail]string{
		0:   "成功",                // 成功
		27:  "微信红包待领取",           // 微信红包已发放，待领取
		111: "系统打款成功",            // 系统打款成功
		112: "经纪公司打款成功",          // 经纪公司打款成功
		211: "系统打款失败",            // 系统打款失败
		212: "经纪公司打款失败",          // 经纪公司打款失败
		213: "系统打款和经纪公司打款都失败",    // 系统打款和经纪公司打款都失败
		261: "支付宝账号错误",           // ⽀付宝账号错误
		262: "支付宝账号与姓名不匹配",       // ⽀付宝账号与姓名不匹配
		265: "身份证号或收款户名不可以为空",    // 身份证号或收款户名不可以为空
		266: "支付宝账号受限",           // 用户可能未完成支付宝实名认证
		271: "微信账号错误",            // 微信账号错误
		273: "此请求可能存在⻛风险，已被微信拦截", // 换⼀个活跃的微信号
		274: "该⽤用户今⽇领取红包个数超过限额",  // 该⽤户今日领取红包个数超过限额
		275: "微信红包发送红包金额不在限额范围内", // 发送红包金额不在限额范围内
		277: "OpenID和AppID不匹配",   // OpenID和AppID不不匹配
		278: "微信红包超过频率限制，请稍后重试",  // 微信红包超过频率限制，请稍后重试
	}
)

func (s OrderStatus) Message() string {
	if msg, ok := orderStatus[s]; ok {
		return msg
	}
	return fmt.Sprintf("%v", s)
}

func (d OrderStatusDetail) Message() string {
	if msg, ok := orderStatusDetail[d]; ok {
		return msg
	}
	return fmt.Sprintf("%v", d)
}
